config.org
#+TITLE: My Doom Config
#+PROPERTY: header-args :tangle "config.el"


* Introduction

This is my config file for Doom Emacs. It reflects my primary needs for an
academic writing environment, with some coding.

Note: I have an SSD (~/~) and a HDD (~/HDD/~). Some files I prefer to save in my HDD. If you have only one device, some commands may be unnecessary (/e.g./ (~set org-directory '~/HDD/PhD/~)

** Inspirations

- [[https://github.com/sunnyhasija/Academic-Doom-Emacs-Config]]
- [[https://gist.github.com/bdarcus/4c50f5c0eb49656298a9bb4c73e725ac]]



* Me
:PROPERTIES:
:ID:       9ad5be6b-9352-4dea-9363-c6974fe31f25
:END:

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Gabriel Petrini"
      user-mail-address "gpetrinidasilveira@gmail.com")
#+END_SRC

#+RESULTS:
: gpetrinidasilveira@gmail.com


* Rudimentary Settings and definitions
:PROPERTIES:
:ID:       f9c43d1b-ca49-43e1-ae47-cb788250a602
:END:

#+BEGIN_SRC emacs-lisp
;; (setq package-native-compile t)
(setq-default
    delete-by-moving-to-trash t         ; Delete files to trash
    tab-width 4                         ; Set width for tabs
    uniquify-buffer-name-style 'forward ; Uniquify buffer names
    window-combination-resize t         ; take new window space from all other windows (not just current)
    x-stretch-cursor t
    load-prefer-newer t                 ; Native-comp related
 )                                      ; Stretch cursor to the glyph width

(setq evil-want-fine-undo t             ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t               ; Nobody likes to loose work, I certainly don't
      inhibit-compacting-font-caches t  ; When there are lots of glyphs, keep them in memory
                                        ;                                               ; undo-limit 80000000                          ; Raise undo-limit to 80Mb
      truncate-string-ellipsis "…")     ; Unicode ellispis are nicer than "...", and also save /precious/ space

(delete-selection-mode 1)               ; Replace selection when inserting text
(display-time-mode 1)                   ; Enable time in the mode-line
(global-subword-mode 1)                 ; Iterate through CamelCase words
(setq
    storage-directory "/HDD/"           ;
    org-directory "~/Org/"
    org-roam-directory (expand-file-name "notes/" org-directory)
    org-agenda-files '(expand-file-name "agenda.org" org-directory)
    org-notes-directory org-roam-directory
    gtd-directory (expand-file-name "gtd/" org-directory)
    inbox-file-path (expand-file-name "inbox.org" gtd-directory)
    notes-directory (expand-file-name "notes" org-directory)
    pdfs-directory  (expand-file-name "PDFs/" storage-directory)
    refs-files '((expand-file-name "zotero_refs.bib" org-directory))
    main-ref-file (expand-file-name "zotero_refs.bib" org-directory)
    org-roam-v2-ack t
 )
#+END_SRC



* Full Screen Emacs
:PROPERTIES:
:ID:       ab0a9384-3179-42a7-b6aa-cf07a4cb89d9
:END:
I like to emacs to be fullscreen when I open it for the first time.
#+BEGIN_SRC emacs-lisp
(if (eq initial-window-system 'x)                 ; if started by emacs command or desktop file
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
#+END_SRC

#+RESULTS:

* An Integrated Academic Environment
:PROPERTIES:
:ID:       c969078a-b2c7-4480-9efa-9e296bec8a45
:END:


While we're at it, let's set the default BibTeX dialect to BibLaTeX, which is
more appropriate for social sciences and humanities.

 By default Org uses pdflatex × 3 + bibtex. This simply won’t do in our modern world. latexmk + biber (which is used automatically with latexmk) is a simply superior combination.


#+BEGIN_SRC emacs-lisp
;; (setq org-latex-pdf-process
;;       '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
;;         "biber %b"
;;         "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
;;         "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

(setq org-latex-pdf-process '("latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"))

#+END_SRC


* Editor
:PROPERTIES:
:ID:       856efcd6-85ab-491e-9815-61ef55628b6d
:END:

#+BEGIN_SRC emacs-lisp
;; (setq doom-font (font-spec :family "Yanone Kaffeesatz" :size 30))
;; (setq  doom-font (font-spec :family "Fira Mono" :size 20))
;; (setq  doom-font (font-spec :family "Roboto Mono" :size 20))
;; (setq doom-theme 'doom-material)
(setq doom-theme 'doom-dracula)
;; Line numbers are pretty slow all around. The performance boost of
;; disabling them outweighs the utility of always keeping them on.
(setq display-line-numbers-type nil)
(setq org-support-shift-select t)
(after! org
  (setq org-image-actual-width '(300))
  (use-package! ox-extra
    :config
    (ox-extras-activate '(latex-header-blocks ignore-headlines)))
  )
(setq evil-normal-state-cursor '(box "orange")
      evil-insert-state-cursor '(bar "orange")
      evil-visual-state-cursor '(hollow "orange"))
(setq org-export-headline-levels 5) ; I like nesting

(set-face-foreground 'vertical-border (doom-color 'red))
(setq window-divider-default-bottom-width 4  ; default is 1
      window-divider-default-right-width 4)  ; default is 1

(custom-set-faces! '(window-divider :foreground "grey"))
#+END_SRC

* Org-mode


** General config

:PROPERTIES:
:ID:       0ac56cd6-ed1b-4d4d-a458-2277d20a25b8
:END:
#+begin_src emacs-lisp
(after! org
  (require 'org-bullets)  ; Nicer bullets in org-mode
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-ellipsis " ▼ "
        org-log-done 'time
        org-enable-roam-support t
        org-src-window-setup 'other-window ;; FIXME
        org-startup-folded 'overview
        org-hide-emphasis-markers t))

(defun org-archive-done-tasks ()
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
   "/DONE" 'tree))

(add-hook! org-mode :append #'org-appear-mode)


(setq
 org-cite-csl-styles-dir "~/Zotero/styles"
 ;; org-cite-global-bibliography '(main-ref-file)
      )

#+end_src

#+RESULTS:





** Headers
:PROPERTIES:
:ID:       28baee43-f1c8-4d29-a306-8f052b324545
:END:

#+begin_src emacs-lisp
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "output replace")
        (:exports . "results")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        ))
#+end_src


