config.org
** Symbols
:PROPERTIES:
:ID:       e2279c30-f79d-49f0-8f69-e4b712736458
:END:

#+begin_src emacs-lisp
(after! org-superstar
  (setq org-superstar-headline-bullets-list '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
        ;; org-superstar-headline-bullets-list '("Ⅰ" "Ⅱ" "Ⅲ" "Ⅳ" "Ⅴ" "Ⅵ" "Ⅶ" "Ⅷ" "Ⅸ" "Ⅹ")
        org-superstar-prettify-item-bullets t ))

(setq org-ellipsis " ▾ "
      org-hide-leading-stars t
      org-priority-highest ?A
      org-priority-lowest ?E
      org-priority-faces
      '((?A . 'all-the-icons-red)
        (?B . 'all-the-icons-orange)
        (?C . 'all-the-icons-yellow)
        (?D . 'all-the-icons-green)
        (?E . 'all-the-icons-blue)))


(appendq! +ligatures-extra-symbols
          `(:checkbox      "☐"
            :pending       "◼"
            :checkedbox    "☑"
            :list_property "∷"
            :em_dash       "—"
            :ellipses      "…"
            :arrow_right   "→"
            :arrow_left    "←"
            :title         "𝙏"
            :subtitle      "𝙩"
            :author        "𝘼"
            :date          "𝘿"
            :property      "☸"
            :options       "⌥"
            :latex_class   "🄲"
            :latex_header  "⇥"
            :beamer_header "↠"
            :attr_latex    "🄛"
            :attr_html     "🄗"
            :begin_quote   "❝"
            :end_quote     "❞"
            :caption       "☰"
            :header        "›"
            :results       "🠶"
            :begin_export  "⏩"
            :end_export    "⏪"
            :properties    "⚙"
            :end           "∎"
            :priority_a   ,(propertize "⚑" 'face 'all-the-icons-red)
            :priority_b   ,(propertize "⬆" 'face 'all-the-icons-orange)
            :priority_c   ,(propertize "■" 'face 'all-the-icons-yellow)
            :priority_d   ,(propertize "⬇" 'face 'all-the-icons-green)
            :priority_e   ,(propertize "❓" 'face 'all-the-icons-blue)))
(set-ligatures! 'org-mode
  :merge t
  :checkbox      "[ ]"
  :pending       "[-]"
  :checkedbox    "[X]"
  :list_property "::"
  :em_dash       "---"
  :ellipsis      "..."
  :arrow_right   "->"
  :arrow_left    "<-"
  :title         "#+title:"
  :subtitle      "#+subtitle:"
  :author        "#+author:"
  :date          "#+date:"
  :property      "#+property:"
  :options       "#+options:"
  :latex_class   "#+latex_class:"
  :latex_header  "#+latex_header:"
  :beamer_header "#+beamer_header:"
  :attr_latex    "#+attr_latex:"
  :attr_html     "#+attr_latex:"
  :begin_quote   "#+begin_quote"
  :end_quote     "#+end_quote"
  :caption       "#+caption:"
  :header        "#+header:"
  :begin_export  "#+begin_export"
  :end_export    "#+end_export"
  :results       "#+RESULTS:"
  :property      ":PROPERTIES:"
  :end           ":END:"
  :priority_a    "[#A]"
  :priority_b    "[#B]"
  :priority_c    "[#C]"
  :priority_d    "[#D]"
  :priority_e    "[#E]")
(plist-put +ligatures-extra-symbols :name "⁍")
#+end_src


** Extra special strings
:PROPERTIES:
:ID:       09cfe794-13e8-43ab-b45b-f1fb7b58d489
:END:

LaTeX already recognises =---= and =--= as em/en-dashes, =\-= as a shy hyphen, and the
conversion of =...= to =\ldots{}= is hardcoded into ~org-latex-plain-text~ (unlike
~org-html-plain-text~).

I'd quite like to also recognise =->= and =<-=, so let's set come up with some advice.

#+begin_src emacs-lisp
(defvar org-latex-extra-special-string-regexps
  '(("->" . "\\\\textrightarrow{}")
    ("<-" . "\\\\textleftarrow{}")))

(defun org-latex-convert-extra-special-strings (string)
  "Convert special characters in STRING to LaTeX."
  (dolist (a org-latex-extra-special-string-regexps string)
    (let ((re (car a))
          (rpl (cdr a)))
      (setq string (replace-regexp-in-string re rpl string t)))))

(defadvice! org-latex-plain-text-extra-special-a (orig-fn text info)
  "Make `org-latex-plain-text' handle some extra special strings."
  :around #'org-latex-plain-text
  (let ((output (funcall orig-fn text info)))
    (when (plist-get info :with-special-strings)
      (setq output (org-latex-convert-extra-special-strings output)))
    output))
#+end_src


** Org-web-tools


#+begin_src emacs-lisp
(use-package! org-web-tools
  :defer t
)
#+end_src

** Agenda


#+begin_src emacs-lisp
(use-package! org-super-agenda
  :commands org-super-agenda-mode)
(after! org-agenda
  (org-super-agenda-mode))

(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-todo-ignore-deadlines t
      org-agenda-tags-column 100 ;; from testing this seems to be a good value
      org-agenda-compact-blocks t)

(setq org-agenda-custom-commands
      '(("o" "Overview"
            ((agenda "" ((org-agenda-overriding-header "")
                        (org-super-agenda-groups
                         '(
                           (:auto-group t)
                           (:name "Today"
                                  :time-grid t
                                  :date today
                                  :order 1)
                          (:name "Due Today"
                           :scheduled t
                           :deadline today
                           :todo "TODO"
                           :order 2)
                          (:name "Due Soon"
                           :scheduled future
                           :todo "TODO"
                           :order 2)
                          (:name "Overdue"
                           :deadline past
                           :todo "TODO"
                           :face error
                           :order 1)
                           )))
                     )
                (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '(
                           (:auto-group t)
                          (:name "Lectures"
                           :tag ("@Teaching" "@Lectures")
                           :order 8)
                          (:name "Advisoring"
                           :tag "@Orientations"
                           :order 8)
                          (:name "Meetings"
                           :tag "@Meeting"
                           :order 5)
                          (:name "Current Research"
                           :tag "@Article"
                           :order 6)
                          (:name "To read"
                           :file-path "readings"
                           :order 8
                           )
                          (:name "To writing"
                           :todo ("STRT")
                           :order 4)
                          (:name "Waiting"
                           :todo ("WAITING" "WAIT" "MAYBE")
                           :order 20)
                          (:name "Research groups"
                           :tag ("@Group")
                           :order 10)
                          (:name "University"
                           :tag ("@UNICAMP")
                           :order 10)
                          (:name "Emacs"
                           :tag ("@Emacs")
                           :order 80)
                          (:name "Trivial"
                           :tag ("@free")
                           :order 90)
                          ))))))))
#+end_src


** Fix problematic hooks


[[https://tecosaur.github.io/emacs-config/config.html#fix-problematic-hooks][source]]

#+begin_src emacs-lisp
(defadvice! shut-up-org-problematic-hooks (orig-fn &rest args)
  :around #'org-fancy-priorities-mode
  :around #'org-superstar-mode
  (ignore-errors (apply orig-fn args)))
#+end_src

** ox-word

* Graphviz
:PROPERTIES:
:ID:       321c5dc9-49d3-4ec1-ad53-963a795a87db
:END:

#+begin_src emacs-lisp
(use-package! graphviz-dot-mode
  :defer t
  :commands graphviz-dot-mode
  :mode ("\\.dot\\'" "\\.gz\\'"))
#+end_src
* Elfeed
** Pre-config
:PROPERTIES:
:ID:       c01430da-5ed2-4865-acce-b6e7878d8558
:END:

#+begin_src emacs-lisp
(use-package! elfeed-org
  :defer t
  :config
  (setq rmh-elfeed-org-files (list (expand-file-name "rss/elfeed.org" org-directory))))
#+end_src

