config.org
** LSP
:PROPERTIES:
:ID:       f3ed513f-42c5-4cf0-ad94-32bffa0f9a64
:END:

#+begin_src emacs-lisp
;; In case we get a wrong workspace root, we can delete it with lsp-workspace-folders-remove
(after! lsp-mode
  (setq lsp-auto-guess-root nil))
(set-popup-rule! "^\\*lsp-help" :side 'right :size .50 :select t :vslot 1)

;; Disable lsp flycheck checker and use flake8
(after! lsp-mode
  (setq lsp-diagnostic-package :none))

(after! flycheck
  (add-hook 'pyhon-mode-local-vars-hook
            (lambda ()
              (when (flycheck-may-enable-checker 'python-flake8)
                (flycheck-select-checker 'python-flake8)))))
;; (setq flycheck-disabled-checkers 'lsp)

(after! lsp-mode
  (setq lsp-eldoc-enable-hover nil
        lsp-signature-auto-activate nil
        ;; lsp-enable-on-type-formatting nil
        ;; lsp-enable-symbol-highlighting nil
        lsp-enable-file-watchers nil))
#+end_src

** Magit
:PROPERTIES:
:ID:       953bffb5-6de5-41d7-a517-6f113d1112e1
:END:

#+begin_src emacs-lisp
(after! magit
  ;; (magit-wip-mode)
  (setq magit-save-repository-buffers nil
        ;; Don't restore the wconf after quitting magit
        magit-inhibit-save-previous-winconf t
        magit-log-arguments '("--graph" "--decorate" "--color")
        ;; magit-delete-by-moving-to-trash nil
        git-commit-summary-max-length 120))
#+end_src
** Netlogo

*** NetLogo mode and company-netlogo
:PROPERTIES:
:ID:       3a86c393-efc9-49f6-a6d4-df918e6d18af
:END:

#+begin_src emacs-lisp :tangle no
(load! "netlogo/netlogo-mode")
(load! "netlogo/company-netlogo")

(set-company-backend! 'netlogo-mode '(:separate company-netlogo company-yasnippet))
#+end_src





* LaTeX

** Latex Process
:PROPERTIES:
:ID:       a1e804dc-ee54-4478-b8e1-6f317d061e09
:END:

#+BEGIN_SRC emacs-lisp
(load! "scimax-org-latex.el")

(setq org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "biber %b"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))


;; (setq org-latex-pdf-process '("latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"))
#+END_SRC

** Labels and captions
:PROPERTIES:
:ID:       7eaf0644-cc5e-4dbc-a405-102080ef39aa
:END:

#+BEGIN_SRC emacs-lisp
(setq org-latex-prefer-user-labels t)
(setq org-latex-caption-above nil)
#+END_SRC

** Math support
:PROPERTIES:
:ID:       6070e801-b991-4dab-8932-58175a6a54c4
:END:
#+begin_src emacs-lisp
(use-package! cdlatex
    :after (:any org-mode LaTeX-mode)
    :hook
    ((LaTeX-mode . turn-on-cdlatex)
     (org-mode . turn-on-org-cdlatex)))

(use-package! company-math
    :after (:any org-mode TeX-mode)
    :config
    (set-company-backend! 'org-mode 'company-math-symbols-latex)
    (set-company-backend! 'TeX-mode 'company-math-symbols-latex)
    (set-company-backend! 'org-mode 'company-latex-commands)
    (set-company-backend! 'TeX-mode 'company-latex-commands)
    (setq company-tooltip-align-annotations t)
    (setq company-math-allow-latex-symbols-in-faces t))
#+end_src

** Tufte booker
:PROPERTIES:
:ID:       edda38cc-1212-4a28-94a8-256e9d330981
:END:
#+begin_src emacs-lisp
(add-to-list
 'org-latex-classes
 '(("tufte-book"
    "\\documentclass[a4paper, sfsidenotes, openany, justified]{tufte-book}"
    ("\\part{%s}" . "\\part*{%s}")
    ("\\chapter{%s}" . "\\chapter*{%s}")
    ("\\section{%s}" . "\\section*{%s}")
    ("utf8" . "utf8x")
    ("\\subsection{%s}" . "\\subsection*{%s}"))))
#+end_src
** Default refs
:PROPERTIES:
:ID:       3dcb1860-7b51-4ff3-a5ae-1c1c62ac5b4d
:END:

#+begin_src emacs-lisp
(setq reftex-default-bibliography refs-files)
#+end_src
** Viewer
:PROPERTIES:
:ID:       78bce554-5c5f-40ae-b07c-7b8e88895f48
:END:

#+begin_src emacs-lisp
(setq +latex-viewers '(evince pdf-tools okular))
#+end_src

** Prittier highlighting
:PROPERTIES:
:ID:       7ad5df1c-7f6e-49c5-8cb3-c60e94435f5a
:END:

First off, we want those fragments to look good.

#+begin_src emacs-lisp
(setq org-highlight-latex-and-related '(native script entities))

#+end_src

 However, by using native highlighting the org-block face is added, and that doesn’t look too great — particularly when the fragments are previewed.

Ideally org-src-font-lock-fontify-block wouldn’t add the org-block face, but we can avoid advising that entire function by just adding another face with :inherit default which will override the background colour.

Inspecting org-do-latex-and-related shows that "latex" is the language argument passed, and so we can override the background as discussed above.

#+begin_src emacs-lisp
(add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t)))
#+end_src

* PDF tools
:PROPERTIES:
:ID:       df7993d2-dc70-43de-aab6-bd1845252531
:END:

#+begin_src emacs-lisp
(setq pdf-annot-activate-created-annotations t
      pdf-view-display-size 'fit-width
      pdf-view-resize-factor 1.1)
#+end_src

* Org-noter
:PROPERTIES:
:ID:       3353c759-0c2d-4133-9733-69d09a1b7f69
:END:

#+begin_src emacs-lisp
(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; The WM can handle splits
   org-noter-notes-window-location 'other-frame
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   ;; I want to see the whole file
   org-noter-hide-other nil
   ;; Everything is relative to the rclone mega
   org-noter-notes-search-path (list org-directory)
   org-noter-notes-window-location 'horizontal-split
   bibtex-completion-pdf-field "file"
   )
  ;; (require 'org-noter-pdftools)
  )
#+end_src


* WAIT Org-pdftools

#+begin_src emacs-lisp :tangle no
(use-package! org-noter-pdftools
  :after org-noter
  :config
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freestyle-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
#+end_src

* Org-roam-bibtex


Waiting the removal of org-ref as a required package.

#+begin_src emacs-lisp :tangle no

(use-package! org-roam-bibtex
  :after org-roam
  :config
  ;; (require 'org-ref)
  (setq orb-preformat-keywords
    '("citekey" "title" "url" "author-or-editor" "keywords" "file" "year" "note")
    orb-process-file-keyword t
    orb-file-field-extensions '("pdf")
  ))

#+end_src

* Org-roam

#+begin_src emacs-lisp
(after! org-roam
  (setq org-roam-db-location "~/Org/notes/org-roam.db")
)
#+end_src

